<template>
	<div class="box">
		<van-nav-bar :title="type == 0 ? '用户服务' : '隐私政策'" fixed :placeholder="true" left-arrow class="header" @click-left="$router.back()" />

		<div class="content">
			<div class="title">用户服务协议</div>
			协议版本：【1.0】；发布/生效日期：【2018年11月15日】 欢迎您注册平台账号并使用平台的服务！
			本《平台用户服务协议》（以下简称“本服务协议”）是您与平台之间就注册平台用户账号及使用平台的各项服务等相关事宜所订立的协议。为使用平台的服务，您应当仔细阅读并遵守本服务协议下的全部内容，特别是涉及免除或者责任限制的条款，该类条款可能以黑体加粗或加下划线的形式提示您重点注意。除非您已阅读并接受本服务协议所有条款，否则您将不能注册平台账号或使用平台的服务，如您不同意本服务条款的任意内容，请勿注册或使用平台的服务，并应立即停止注册程序。如您对本服务协议的内容（特别是涉及免除或者责任限制的条款）有任何疑义，可随时按照本服务协议中列明的联系方式与我们联系，我们将根据您的要求为您进一步解释和说明相关内容。如您勾选“我同意《平台平台用户服务协议》”并通过注册程序或其他任何方式使用或接受平台的任何服务，即视为您已阅读并同意本服务协议，自愿接受本服务协议的所有内容的约束。请您在决定注册或使用服务前再次确认您已知悉并完全理解本服务协议的所有内容。
			如果您未满18周岁，请务必在家长和其他法定监护人的陪同下阅读本服务协议，并在进行注册、下单、支付等任何行为或使用美团点评的其他任何服务前，应事先征得您的家长和其他法定监护人的同意。
			本服务协议所述“服务”既包括您使用美团点评用户账号接受美团点评平台相关商家、个人所提供的服务，亦包括在某些特定的业务类别下您使用美团点评用户账号向其他商家、个人或其他主体提供服务的情形。无论“服务”属于上述何种情形，本《美团点评平台用户服务协议》都将予以适用。
			一、协议的主体与范围 【签约主体】
			视您所使用的具体服务而定，“美团点评”是指美团点评旗下运营或提供您所使用的相关具体服务的相关主体的统称，您可在相关服务的具体服务条款或说明文件中查看上述主体的名称和信息。
			“用户”是指使用美团点评相关服务的使用人，在本服务协议中更多称呼为“您”。 【协议内容】本服务协议内容同时包括：
			（1）本《美团点评平台用户服务协议》文本（下载地址：https://portal-portm.meituan.com/webpc/useragree)）； （2）《美团点评平台隐私政策》( 链 接 地
			址
			:https://www.meituan.com/about/privacy)：美团点评非常重视您的个人信息和隐私的保护，将按照《美团点评平台隐私政策》中所公布的政策在具体服务中进行隐私及个人信息的收集、存储、使用、披露等活动。您在注册美团点评账号前，应仔细阅读《美团点评平台隐私政策》；
			（3）具体服务的服务条款：您的美团点评平台账号一经注册，即可凭该账号按规定享受美团点评平台上的各项丰富的服务。为更好地向您提供各项服务，美团点评平台针对具体的服务制定了专门的服务条款，供服务各方遵守。您可在【相关具体服务的网站、页面或应用程序】中查阅并下载此类专门服务条款。您在使用具体服务前，应仔细阅读该服务所适用的服务条款，您注册美团点评账号并利用美团点评账号使用具体服务即表示您已同时接受该等服务条款，并将受该等服务条款的约束；
			（4）专项商品或服务规则。为更好地提升用户体验，美团点评在若干具体专项商品或服务中特别制定了详细的规则，供各方遵守。
			（5）第三方服务相关的用户授权协议。为方便您在使用美团点评平台服务的同时，根据您自身需要，通过美团点评平台进行跳转等方式，自愿选择接受独立第三方服务商及部分关联第三方服务商所提供的服务，您将在使用该等第三方服务前对相应的用户授权协议予以同意确认，以作为您和美团点评平台之间就该等第三方服务的使用所涉及的相关事项的权利义务依据。
			上述各项内容之间如存在不一致之处，以时间上最新发布的内容为准，发布时间相同的，以本款【协议内容】中所包含的组成部分的序号倒序排列为准
			【协议遵守】您理解并同意：
			（1）上述【协议内容】中所述的协议、政策、条款与规则构成本服务协议不可分割的组成部分，共同适用于您所使用的美团点评平台服务。
			（2）根据国家法律法规变化、运营需要或为提升服务质量的目的，美团点评将在必要的时候对上述各项协议、条款与规则不时地进行修改更新，并通过在网页或移动客户端上发出公告、站内信等合理、醒目的方式向您进行提前通知，上述修改更新内容将在相关更新说明中指定的日期开始实施，通常情况下不短于发布之日后八个自然日。
			（3）您应当及时查阅并了解相关更新修改内容，如您不同意相关更新修改内容，可停止使用相关更新修改内容所涉及的服务，此情形下，变更事项对您不产生效力；如您在上述更新修改内容实施后继续使用所涉及的服务，将视为您已同意各项更新修改内容。
			【适用平台】本服务协议适用于网页端、移动客户端（包括IOS、安卓及已有或未来将新增的任何其他移动客户端）等各类平台或媒介中美团点评所提供的各项服务。您知悉并理解，为享受上述相关服务，您必须自行提供相关上网设备（如：个人电脑、手机、平板电脑或其他设备）并自行负担相关网络使用和商品服务支付所产生的有关费用。
			二、账号的注册
			【注册资料】您应遵循诚实信用、合法善意的原则，向美团点评提交相关注册资料，相关注册资料应当遵守法律法规、社会主义制度、国家利益、公民合法权益、公序良俗、信息真实等原则，不应提交任何违法或不良信息，相关资料如有变动，您应及时更新。如果因您所提供的注册资料不合法、不真实、不准确或未及时更新，从而导致相关法律责任或不利后果的，您将承担相应的法律责任及不利后果。
			您已知悉，在美团点评账号注册过程中，因安全性、内部管理等原因，部分初始注册资料可能将无法再次更改。因此，您应谨慎核查此部分注册资料，确保正确填写。
			【民事行为能力】您知悉并承诺，您具有完全民事权利能力和行为能力或虽不具有完全民事权利能力和行为能力但已经过您的家长和其他法定监护人同意并由您的家长和其他法定监护人代理注册及使用美团点评的各项服务。若您不具备前述相适应的民事行为能力即进行账号注册的，则您及您的家长和其他法定监护人应依照法律规定承担因此而导致的一切后果。
			【真实身份】因国家法律法规、监管要求及特定门类的服务（如金融服务等）需要，您有可能需要在注册或使用该等服务的特定环节中填写真实的身份信息，并需通过相关验证流程后方可使用服务，如您填写的身份信息不完整、不真实或未通过验证，将导致您无法使用该服务、损害自身、他人利益或造成其他不利后果，该等后果将由您予以承担。
			【注册信息保护】美团点评将对您所提交的注册信息予以保护，不会将其披露给任何非关联的第三方，除非： （1）相关法律法规或国家机关要求；
			（2）美团点评发生相关合并、分立、收购或资产转移；或 （3）为提供相关服务所必须的
			对于您所提交的注册信息中涉及个人信息的内容，美团点评将严格按照《美团点评平台隐私政策》的规定进行收集、处理和使用。
			【账号数量】除因历史原因、业务整合等美团点评所认可的特殊情况外，美团点评原则上只允许您使用一个美团点评用户账号。如有证据证明或美团点评有理由相信您存在不当注册或不当使用多个美团点评账号的情形，美团点评可将相关账号信息进行合并或采取其他合理措施，如因您不当注册或不当使用给美团点评及相关方造成损失的，您还应承担相应的赔偿责任。此外，出于相关业务需要，美团点评也可对同一用户的多个账号或相关信息进行合并，如该等合并将对您的权益产生实质影响，美团点评将在进行上述合并前事先征得您的同意。
			三、账号的使用
			【账号登录】您可以使用注册账号时填写登记的并获得系统审核通过的账号密码登录美团点评平台。为了您的使用便利，美团点评将适时提供指纹识别、人脸识别等更为安全便捷的登录方式，美团点评可根据相关法律法规、监管要求、用户体验、风险控制等因素对登录方式予以适时调整或增减，或在具体业务门类的用户服务条款等规定中予以进一步细化或调整。
			【账号使用】您应对您账号项下的所有行为（包括但不限于在线签署任何协议，浏览、购买、支付、点评、上传、发布、输入任何内容）所产生的一切后果负责，通过您的账号所发生的上述各项行为将视为您本人的真实意思表示。
			美团点评提示您，您通过自身账号在接受美团点评的各项服务中所上传、发送的任何内容都应具有合法来源，如相关内容涉及任何第三方的合法权益，应事先获得相应的许可。如美团点评收到涉及您的相关举报或投诉，美团点评可采取相关法律法规所要求或允许的方式，向相关争议方、相关部门提供包括账号在内的必要的信息，以便解决纠纷争议，保护正当权利人的合法权益。
		</div>
	</div>
</template>

<script setup lang="ts">
import { useRoute } from 'vue-router'
import { onMounted, ref } from 'vue'
import { computed } from 'vue'
const route = useRoute()
const type = ref(0)
onMounted(() => {
	type.value = route.query.type as unknown as number
})
</script>

<style scoped>
.box {
	height: 100vh;
	width: 100vw;
	background-color: #f1f1f1;
}
.content {
	background-color: #fff;
	border-radius: 6px;
	margin: 10px;
	height: 90%;
	font-size: 14px;
	padding: 0 10px;
	overflow-y: auto;
}
.title {
	text-align: center;
	font-size: 18px;
}
</style>
